import math


def area(r):
    """
    Вычисляет площадь круга.

    Параметры:
        r (int/float): радиус круга.

    Возвращаемое значение:
        float: площадь круга.

    Пример вызова:
        area(5)
        Результат: 78.53981633974483
    """
    return math.pi * r * r


def perimeter(r):
    """
    Вычисляет длину окружности.

    Параметры:
        r (int/float): радиус круга.

    Возвращаемое значение:
        float: длина окружности.

    Пример вызова:
        perimeter(5)
        Результат: 31.41592653589793
    """
    return 2 * math.pi * r