def area(a, b):
    """
    Вычисляет площадь прямоугольника.

    Параметры:
        a (int/float): длина первой стороны.
        b (int/float): длина второй стороны.

    Возвращаемое значение:
        int/float: площадь прямоугольника.

    Пример вызова:
        area(4, 6)
        Результат: 24
    """
    return a * b


def perimeter(a, b):
    """
    Вычисляет периметр прямоугольника.

    Параметры:
        a (int/float): длина первой стороны.
        b (int/float): длина второй стороны.

    Возвращаемое значение:
        int/float: периметр прямоугольника.

    Пример вызова:
        perimeter(4, 6)
        Результат: 20
    """
    return (a + b) * 2