def area(a):
    """
    Вычисляет площадь квадрата.

    Параметры:
        a (int/float): длина стороны квадрата.

    Возвращаемое значение:
        int/float: площадь квадрата.

    Пример вызова:
        area(5)
        Результат: 25
    """
    return a * a


def perimeter(a):
    """
    Вычисляет периметр квадрата.

    Параметры:
        a (int/float): длина стороны квадрата.

    Возвращаемое значение:
        int/float: периметр квадрата.

    Пример вызова:
        perimeter(5)
        Результат: 20
    """
    return 4 * a